tap "containeroo/tap"
tap "hashicorp/tap"
tap "homebrew/services"
tap "nikitabobko/tap"
# General-purpose data compression with high compression ratio
brew "xz"
# GitOps Continuous Delivery for Kubernetes
brew "argocd"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# CLI to install, manage & troubleshoot Kubernetes clusters running Cilium
brew "cilium-cli"
# Utility that creates projects from templates and maintains the cruft afterwards
brew "cruft"
# Load/unload environment variables based on $PWD
brew "direnv"
# Convert text between DOS, UNIX, and Mac formats
brew "dos2unix"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# GNU grep, egrep and fgrep
brew "grep"
# Kubernetes package manager
brew "helm"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Little helper to run CNCF's k3s in Docker
brew "k3d"
# Fast and secure open-source backup
brew "kopia"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Package manager for kubectl plugins
brew "krew"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Easily check your clusters for use of deprecated APIs
brew "kubent"
# Template-free customization of Kubernetes YAML manifests
brew "kustomize"
# Powerful, lightweight programming language
brew "lua"
# Replacement for ls, cp and other commands for object storage
brew "minio-mc"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node"
# Password generator
brew "pwgen"
# Python version management
brew "pyenv"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# User interface to the TELNET protocol
brew "telnet"
# Terminal multiplexer
brew "tmux"
# Plugin manager for tmux
brew "tpm"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Creates fully functional virtual k8s cluster inside host k8s cluster's namespace
brew "vcluster"
# Disaster recovery for Kubernetes resources and persistent volumes
brew "velero"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Simple CLI tool to fetch GitLab CI variables and output them as exportable environment variables.
brew "containeroo/tap/ci-thief"
# Simple CLI tool to generate Docker config.json with registry credentials
brew "containeroo/tap/dologen"
# Simple CLI tool to generate OTP tokens
brew "containeroo/tap/otpgen"
# MDV Digest Viewer
brew "mdv"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Wireshark App
cask "wireshark"
# Command-line interface for 1Password
cask "1password-cli"
# AeroSpace is an i3-like tiling window manager for macOS
# cask "aerospace"
# Application uninstaller
cask "appcleaner"
# Web browser
cask "firefox"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
tap "containeroo/tap"
tap "hashicorp/tap"
tap "homebrew/services"
tap "nikitabobko/tap"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Terraform
brew "hashicorp/tap/terraform"
# Vault
brew "hashicorp/tap/vault"
